{
    "format": "graph-model",
    "generatedBy": "2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.19.0",
    "signature": {
      "inputs": {
        "inputs": {
          "name": "inputs:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [
              {
                "size": "-1"
              },
              {
                "size": "144000"
              }
            ]
          }
        }
      },
      "outputs": {
        "scores": {
          "name": "Identity:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [
              {
                "size": "-1"
              },
              {
                "size": "6522"
              }
            ]
          }
        }
      }
    },
    "modelTopology": {
      "node": [
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "1536"
                    },
                    {
                      "size": "48"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "48"
                    },
                    {
                      "size": "1536"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-4_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "1536"
                    },
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "1536"
                    },
                    {
                      "size": "48"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "48"
                    },
                    {
                      "size": "1536"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-3_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "1536"
                    },
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "1536"
                    },
                    {
                      "size": "48"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "48"
                    },
                    {
                      "size": "1536"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_4-2_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "1536"
                    },
                    {
                      "size": "192"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "27"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "27"
                    },
                    {
                      "size": "864"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-5_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "108"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "27"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "27"
                    },
                    {
                      "size": "864"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-4_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "108"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "27"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "27"
                    },
                    {
                      "size": "864"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-3_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "108"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "27"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "27"
                    },
                    {
                      "size": "864"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_3-2_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "864"
                    },
                    {
                      "size": "108"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "288"
                    },
                    {
                      "size": "18"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_SE_CONV_2/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "18"
                    },
                    {
                      "size": "288"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-4_CONV_3/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_FLOAT"
            },
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "288"
                    },
                    {
                      "size": "72"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_AVG_POOL_1/Mean/reduction_indices",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "2"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_RESHAPE/strided_slice/stack",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_RESHAPE/strided_slice/stack_1",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_RESHAPE/strided_slice/stack_2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_RESHAPE/Reshape/shape/1",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_RESHAPE/Reshape/shape/2",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            },
            "dtype": {
              "type": "DT_INT32"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_RESHAPE/Reshape/shape/3",
          "op": "Const",
          "attr": {
            "dtype": {
              "type": "DT_INT32"
            },
            "value": {
              "tensor": {
                "dtype": "DT_INT32",
                "tensorShape": {}
              }
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_CONV_1/Conv2D/ReadVariableOp",
          "op": "Const",
          "attr": {
            "value": {
              "tensor": {
                "dtype": "DT_FLOAT",
                "tensorShape": {
                  "dim": [
                    {
                      "size": "1"
                    },
                    {
                      "size": "1"
                    },
                    {
                      "size": "288"
                    },
                    {
                      "size": "18"
                    }
                  ]
                }
              }
            },
            "dtype": {
              "type": "DT_FLOAT"
            }
          }
        },
        {
          "name": "StatefulPartitionedCall/model/BLOCK_2-3_SE_CONV_2/Conv2D/ReadVariableOp",
